Repository: Khouloud-Bhlel/Flutter-CV
Catalog: locales/*.arb
Languages: ar, fr

# appName
source: CV with Flutter
ar: السيرة الذاتية باستخدام Flutter
fr: CV avec Flutter

# name
source: Khouloud Ben Hlel
ar: خلود بن هلال

source: Contact Information
ar: معلومات الاتصال
fr: Coordonnées

# education
source: 3rd year in Computer System Development
ar: السنة الثالثة في تطوير أنظمة الحاسوب
fr: 3eme année en développement de systèmes informatiques

# projectName
source: Coursera Project Network
ar: شبكة مشاريع Coursera
fr: Réseau de projets Coursera

# projectDescription
source: Create an A/B web page marketing test with Google Optimize | August 29, 2022
ar: إنشاء اختبار تسويق صفحة ويب A/B باستخدام Google Optimize | 29 أغسطس 2022
fr: Créer un test de marketing de page web A/B avec Google Optimize | 29 août 2022

# chatbotProject
source: Create a lead Generation Messenger Chatbot using Chatfuel | August 29, 2022
ar: إنشاء Chatbot لتوليد Leads عبر Messenger باستخدام Chatfuel | 29 أغسطس 2022
fr: Créer un chatbot de génération de leads sur Messenger avec Chatfuel | 29 août 2022

# wordpressProject
source: Create a website with WordPress | May 24, 2022
ar: إنشاء موقع ويب باستخدام WordPress | 24 مايو 2022
fr: Créer un site web avec WordPress | 24 mai 2022

# freeCodeCampCertification
source: Responsive Web Design | September 5, 2023 | Developer Certification
ar: تصميم ويب متجاوب | 5 سبتمبر 2023 | شهادة مطوّر
fr: Design Web Réactif | 5 septembre 2023 | Certification de développeur

# bestSARLTraining
source: Training certification for 1 month in the Company of BEST SARL
ar: شهادة تدريب لمدة شهر في شركة BEST SARL
fr: Certification de formation pendant 1 mois à la société BEST SARL

# 3STraining
source: Training certification for 1 month in Standard Sharing Software Company (3S)
ar: شهادة تدريب لمدة شهر في شركة Standard Sharing Software (3S)
fr: Certification de formation pendant 1 mois à la Standard Sharing Software Company (3S)

source: Certificate of Achievement
ar: شهادة الإنجاز
fr: Certificat de réussite

# digiWordCertification
source: Certification on the program DigiWord by Spectrum in: Digital Marketing, Artificial Intelligence, Agile, Scrum Methodology, Workforce Management
ar: شهادة في برنامج DigiWord من Spectrum في: التسويق الرقمي، الذكاء الاصطناعي، المنهجية السريعة، Scrum، إدارة القوى العاملة
fr: Certification sur le programme DigiWord de Spectrum en : Marketing numérique, Intelligence artificielle, Méthodologie Agile, Scrum, Gestion des effectifs

# cognitiveClass
source: Human Portrait Drawing with U-Squared Net and PyTorch
ar: رسم صورة بشرية باستخدام U-Squared Net و PyTorch
fr: Dessin de portrait humain avec U-Squared Net et PyTorch

# cognitiveClassCertification
source: MapReduce and YARN
ar: MapReduce و YARN
fr: MapReduce et YARN

# canvaProject
source: Use Canva to design digital course materials | August 12, 2022
ar: استخدام Canva لتصميم مواد الدورة الدراسية الرقمية | 12 أغسطس 2022
fr: Utiliser Canva pour concevoir des supports de cours numériques | 12 août 2022

# wordpressFreeWebsite
source: Develop a free website with WordPress | May 24, 2022
ar: تطوير موقع ويب مجاني باستخدام WordPress | 24 مايو 2022
fr: Développer un site web gratuit avec WordPress | 24 mai 2022

# projectListTitle
source: List of Projects
ar: قائمة المشاريع
fr: Liste des Projets

source: View Details
ar: عرض التفاصيل
fr: Voir détails

source: GitHub Link
ar: رابط GitHub
fr: Lien GitHub

# projectDetailsTitle
source: Project 1 Details
ar: تفاصيل المشروع 1
fr: Détails du Projet 1

# internshipTitle
source: Advanced Training Internship
ar: تدريب تطوير متقدم
fr: Stage de Perfectionnement

# webDevelopmentDescription
source: Development of Advanced Web Solutions with Django
ar: تطوير حلول ويب متقدمة باستخدام Django
fr: Développement de Solutions Web Avancées avec Django

source: Class Diagram
ar: رسم توضيحي للصفوف
fr: Diagramme de classe

source: Order Management
ar: إدارة الطلبات
fr: Gestion de commande

# educationn
source: Education
ar: التعليم
fr: Éducation

source: ISET SFAX
ar: المعهد العالي للدراسات التكنولوجية بصفاقس

# isetSfaxDescription
source: Bachelor's degree in Computer Science | 2022-2024 Information Systems Development
ar: شهادة في علوم الحاسوب | 2022-2024 تطوير أنظمة المعلومات
fr: Licence en informatique | 2022-2024 Développement de systèmes d'information

# lyceeMenzeh6
source: Menzeh 6 High School
ar: ثانوية المنزه 6
fr: Lycée Menzeh 6

# lyceeMenzeh6Description
source: Baccalaureate in Computer Science | 2020-2021
ar: شهادة البكالوريا في علوم الحاسوب | 2020-2021
fr: Baccalauréat en informatique | 2020-2021

source: Expertise
ar: الخبرة

# businessInternshipTitle
source: Introduction to Business Internship
ar: تدريب مقدمة في الأعمال
fr: STAGE D'INTRODUCTION EN ENTREPRISE

# businessInternshipDate
source: BEST SARL Company | January 2022 - February 2022
ar: شركة BEST SARL | يناير 2022 - فبراير 2022
fr: Société BEST SARL | janvier 2022 - février 2022

# businessInternshipDescription
source: Integrate the YAKA platform into the company's local network and develop a solution tailored to the needs of BEST SARL (IT department). Integration of Bootstrap on the front-end of the application. Technologies and libraries: OpenVPN, HTML, CSS, JAVA, C#, and DOTNET.
ar: دمج منصة YAKA في الشبكة المحلية للشركة وتطوير حلا متناسبا مع احتياجات BEST SARL (قسم تكنولوجيا المعلومات). دمج Bootstrap على الجهة الأمامية للتطبيق. تقنيات ومكتبات: OpenVPN، HTML، CSS، JAVA، C#، وDOTNET.
fr: Intégrer la plateforme YAKA dans le réseau local de l'entreprise et développer une solution adaptée aux besoins de BEST SARL (département informatique). Intégration de Bootstrap sur le front-end de l'application. Technologies et bibliothèques : OpenVPN, HTML, CSS, JAVA, C# et DOTNET.

# companyInternshipTitle
source: Improvement in Business Internship
ar: تدريب تحسين في الأعمال
fr: STAGE D'AMÉLIORATION EN ENTREPRISE

# companyInternshipDate
source: Standard Sharing Software Company (3S) | July-August 2023
ar: شركة Standard Sharing Software (3S) | يوليو - أغسطس 2023
fr: Standard Sharing Software Company (3S) | juillet-août 2023

# companyInternshipDescription
source: Develop the server-side of the GLOBALNET website, service management, and order management. Use Django as the software. Develop the front-end: an interface containing a map for location, an interface for service, and an interface to order GlobalNet in Tunis. Develop the back-end: service CRUD (add, modify, delete, search). Develop the back-end: order CRUD.
ar: تطوير الجانب الخادم لموقع GLOBALNET، وإدارة الخدمات، وإدارة الطلبات. استخدام Django كبرنامج. تطوير الجانب الأمامي: واجهة تحتوي على خريطة للموقع، واجهة للخدمة، وواجهة لطلب GlobalNet في تونس. تطوير الجانب الخلفي: خدمة CRUD (إضافة، تعديل، حذف، البحث). تطوير الجانب الخلفي: طلب CRUD.
fr: Développer le site web côté serveur GLOBALNET, la gestion de services et la gestion des commandes. Utilise Django comme logiciel. Développer le front-end : une interface contenant une carte pour la localisation, une interface pour le service et une interface pour commander GlobalNet à Tunis. Développer le back-end : service CRUD (ajouter, modifier, supprimer, rechercher). Développer le back-end : commande CRUD.

source: Languages
ar: اللغات
fr: Langues

# arabicLanguage
source: Arabic
ar: العربية
fr: Arabe

# frenchLanguage
source: French
ar: الفرنسية
fr: Français

# englishLanguage
source: English
ar: الإنجليزية
fr: Anglais

# saveButton
source: Save
ar: حفظ
fr: Enregistrer

source: Night
ar: ليل
fr: Nuit

source: Day
ar: نهار
fr: Jour

# settingsTitle
source: Settings
ar: الإعدادات
fr: Paramètres

source: Skills
ar: المهارات
fr: Compétences

source: Programming Languages:
ar: لغات البرمجة:
fr: Langages de programmation :

# programmingLanguagesList
source: HTML, CSS, JavaScript, PHP, C, C#, JAVA, NextJs, MongoDB, Django, SQL, MySQL, UML, Database, dotNet, Ubuntu, Isis, Arduino, Pascal, Python
ar: HTML، CSS، JavaScript، PHP، C، C#، JAVA، NextJs، MongoDB، Django، SQL، MySQL، UML، قاعدة بيانات، dotNet، Ubuntu، Isis، Arduino، Pascal، Python
fr: HTML, CSS, JavaScript, PHP, C, C#, JAVA, NextJs, MongoDB, Django, SQL, MySQL, UML, Base de données, dotNet, Ubuntu, Isis, Arduino, Pascal, Python

source: Software and Tools:
ar: البرمجيات والأدوات:
fr: Logiciels et Outils :

# softwareAndToolsList
source: Microsoft, NodeJs, Linux, React.js, API, GIT, JavaOS, Adobe Family, Movie Maker, Filmora, WordPress
ar: Microsoft، NodeJs، Linux، React.js، API، GIT، JavaOS، عائلة Adobe، Movie Maker، Filmora، WordPress
fr: Microsoft, NodeJs, Linux, React.js, API, GIT, JavaOS, Famille Adobe, Movie Maker, Filmora, WordPress

source: Other Skills:
ar: مهارات أخرى:
fr: Autres compétences :

source: Professional Summary
ar: ملخص مهني
fr: Résumé professionnel

# isetSfaxDate
source: Student / December 2022- June 2024
ar: طالب / ديسمبر 2022 - يونيو 2024
fr: Étudiant / Décembre 2022- Juin 2024

# anticipatedPFE
source: In anticipation of my upcoming End of Studies Project (PFE) scheduled from January to May 2024, I am preparing to embark on a challenging mobile application development project. This venture will involve specializing in Android, using Flutter and Angular for the front end, complemented by Spring Boot for the back end. As a dedicated student, I look forward to seizing this opportunity to expand my technical expertise and collaborate effectively within a dynamic development team. My goal is to enhance my skills in designing user-friendly interfaces, writing efficient code, and cultivating qualities such as responsibility and teamwork. I anticipate substantial progress during this period and am excited to leverage this valuable experience in my future software development endeavors.
ar: توقعًا لمشروعي القادم لنهاية الدراسة (PFE) المقرر من يناير إلى مايو 2024، أنا في استعداد للانطلاق في مشروع تطوير تطبيق محمول محفز. سيشمل هذا المشروع التخصص في Android، باستخدام Flutter و Angular للواجهة الأمامية، مكملة بـ Spring Boot للواجهة الخلفية. كطالب مخلص، أتطلع إلى استغلال هذه الفرصة لتوسيع خبرتي التقنية والتعاون بفعالية داخل فريق تطوير نشط. هدفي هو تعزيز مهاراتي في تصميم واجهات المستخدم سهلة الاستخدام، وكتابة كود فعّال، وتنمية صفات مثل المسؤولية وروح الفريق. أتوقع تحقيق تقدم كبير خلال هذه الفترة وأنا متحمس للاستفادة من هذه التجربة القيمة في مشاريعي البرمجية المستقبلية.
fr: En prévision de mon prochain Projet de Fin d'Études (PFE) prévu de janvier à mai 2024, je me prépare à me lancer dans un projet de développement d'application mobile stimulant. Cette entreprise consistera à me spécialiser dans Android, en utilisant Flutter et Angular pour le front end, complété par Spring Boot pour le back end. En tant qu'étudiant dévoué, j'attends avec impatience de saisir cette opportunité pour élargir mon expertise technique et collaborer efficacement au sein d'une équipe de développement dynamique. Mon objectif est d'améliorer mes compétences en concevant des interfaces utilisateur conviviales, en écrivant un code efficace et en cultivant des qualités telles que la responsabilité et le travail d'équipe. J'anticipe des progrès substantiels au cours de cette période et suis ravi de tirer parti de cette expérience précieuse dans mes futures entreprises de développement de logiciels.
